Revit 2026 API

# CorrectionFactorSetInsert Method

---
**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public virtual bool Insert(
	CorrectionFactor item
)
```
```vb
Public Overridable Function Insert (
	item As CorrectionFactor
) As Boolean
```
```cpp
public:
virtual bool Insert(
	CorrectionFactor^ item
)
```
```fsharp
abstract Insert :
        item : CorrectionFactor -> bool
override Insert :
        item : CorrectionFactor -> bool
```

#### Parameters

item CorrectionFactor

#### Return Value

Boolean

#### Reference

CorrectionFactorSet Class

Autodesk.Revit.DB.Electrical Namespace